In [13]:
import boto3
import pandas as pd
import time

AWS_ACCESS_KEY = "AKIAW5LD4CMQKA2OUOM2"
AWS_SECRET_KEY = "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"
AWS_REGION = "ap-south-1"
SCHEMA_NAME = "asteroid_db"
S3_STAGING_DIR = "s3://dataengcourseworkoutput/output/"
S3_BUCKET_NAME = "dataengcourseworkoutput"
S3_OUTPUT_DIRECTORY = "output"


athena_client = boto3.client(
    "athena",
    aws_access_key_id=AWS_ACCESS_KEY,
    aws_secret_access_key=AWS_SECRET_KEY,
    region_name=AWS_REGION,
)

Dict ={}

def download_and_load_query_results(client: boto3.client, query_response: Dict) -> pd.DataFrame:
    while True:
        try:
            # This function only loads first 1000 rows
            query_execution = client.get_query_execution(QueryExecutionId=query_response["QueryExecutionId"])
            status = query_execution['QueryExecution']['Status']['State']
            if status in ['SUCCEEDED', 'FAILED', 'CANCELLED']:
                break
            time.sleep(0.001)
        except Exception as err:
            if "not yet finished" in str(err):
                time.sleep(0.001)
            else:
                raise err

    temp_file_location: str ="athena_query_results.csv"
    s3_client = boto3.client(
        "s3",
        aws_access_key_id=AWS_ACCESS_KEY,
        aws_secret_access_key=AWS_SECRET_KEY,
        region_name=AWS_REGION,
    )
    
    s3_client.download_file(
           S3_BUCKET_NAME,
           f"{S3_OUTPUT_DIRECTORY}/{query_response['QueryExecutionId']}.csv",
           temp_file_location,
    )
    
    return pd.read_csv(temp_file_location)

response = athena_client.start_query_execution(
    QueryString="SELECT * FROM asteroid1",
    QueryExecutionContext={"Database": SCHEMA_NAME},
    ResultConfiguration={
        "OutputLocation": S3_STAGING_DIR,
        "EncryptionConfiguration": {"EncryptionOption": "SSE_S3"},
    },
)

asteroid1 = download_and_load_query_results(athena_client, response)
asteroid1.head()

,full_name,a,e,g,i,om,w,q,ad,per_y,...,rot_per,gm,bv,ub,ir,spec_b,spec_t,neo,pha,moid
0,6708 Bobbievaile (1989 AA5),2.445918,0.180611,NaN,12.076998,115.802889,193.549521,2.004160,2.887677,3.825350,...,12.3415,NaN,NaN,NaN,NaN,NaN,NaN,N,N,0.990328
1,6709 Hiromiyuki (1989 CD),2.350176,0.159984,NaN,1.827154,98.972518,343.677131,1.974186,2.726166,3.602955,...,6.8280,NaN,NaN,NaN,NaN,NaN,NaN,N,N,0.990167
2,6710 Apostel (1989 GF4),2.800795,0.221773,NaN,6.578358,217.728136,82.662731,2.179655,3.421935,4.687380,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,N,1.175510
3,6711 Holliman (1989 HG),2.565026,0.117859,NaN,14.711108,191.470927,347.431992,2.262714,2.867339,4.108146,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,N,1.267420
4,6712 Hornstein (1990 DS1),2.399101,0.123143,NaN,0.969018,264.136292,322.601840,2.103669,2.694532,3.716045,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,N,1.094110

In [14]:
response = athena_client.start_query_execution(
    QueryString="SELECT * FROM asteroid2",
    QueryExecutionContext={"Database": SCHEMA_NAME},
    ResultConfiguration={
        "OutputLocation": S3_STAGING_DIR,
        "EncryptionConfiguration": {"EncryptionOption": "SSE_S3"},
    },
)

asteroid2 = download_and_load_query_results(athena_client, response)
asteroid2.head()

,full_name,a,e,g,i,om,w,q,ad,per_y,...,rot_per,gm,bv,ub,ir,spec_b,spec_t,neo,pha,moid
0,1 Ceres,2.769165,0.076009,0.12,10.594067,80.305532,73.597694,2.558684,2.979647,4.608202,...,9.074170,62.6284,0.713,0.426,NaN,C,G,N,N,1.59478
1,2 Pallas,2.772466,0.230337,0.11,34.836234,173.080063,310.048857,2.133865,3.411067,4.616444,...,7.813200,14.3000,0.635,0.284,NaN,B,B,N,N,1.23324
2,3 Juno,2.669150,0.256942,0.32,12.988919,169.852760,248.138626,1.983332,3.354967,4.360814,...,7.210000,NaN,0.824,0.433,NaN,Sk,S,N,N,1.03454
3,4 Vesta,2.361418,0.088721,0.32,7.141771,103.810804,150.728541,2.151909,2.570926,3.628837,...,5.342128,17.8000,0.782,0.492,NaN,V,V,N,N,1.13948
4,5 Astraea,2.574249,0.191095,NaN,5.366988,141.576604,358.687608,2.082324,3.066174,4.130323,...,16.806000,NaN,0.826,0.411,NaN,S,S,N,N,1.09589

In [ ]:
# Dealing with missing values

In [15]:
asteroid1.isnull().sum()

full_name         1829
a                 1829
e                 1829
g                 6403
i                 1829
om                1829
w                 1829
q                 1829
ad                1829
per_y             1829
data_arc          1829
condition_code    1829
n_obs_used        1829
h                 1829
diameter          2762
extent            6402
albedo            2764
rot_per           5263
gm                6403
bv                6403
ub                6403
ir                6403
spec_b            6345
spec_t            6403
neo               1829
pha               1829
moid              1829
dtype: int64

In [16]:
remove_null_asteroid1 = asteroid1.dropna()
remove_null_asteroid1.isnull().sum()

full_name         0.0
a                 0.0
e                 0.0
g                 0.0
i                 0.0
om                0.0
w                 0.0
q                 0.0
ad                0.0
per_y             0.0
data_arc          0.0
condition_code    0.0
n_obs_used        0.0
h                 0.0
diameter          0.0
extent            0.0
albedo            0.0
rot_per           0.0
gm                0.0
bv                0.0
ub                0.0
ir                0.0
spec_b            0.0
spec_t            0.0
neo               0.0
pha               0.0
moid              0.0
dtype: float64

In [17]:
rows,cols = remove_null_asteroid1.shape
print("Rows",rows)
print("cols",cols)

Rows 0
cols 27

In [18]:
asteroid2.isnull().sum()

full_name            0
a                    0
e                    0
g                 6593
i                    0
om                   0
w                    0
q                    0
ad                   0
per_y                0
data_arc             0
condition_code       0
n_obs_used           0
h                    0
diameter           613
extent            6694
albedo             627
rot_per           2432
gm                6696
bv                5690
ub                5732
ir                6707
spec_b            5349
spec_t            5732
neo                  0
pha                  0
moid                 0
dtype: int64

In [19]:
remove_null_asteroid2 = asteroid2.dropna()
remove_null_asteroid2.isnull().sum()

full_name         0.0
a                 0.0
e                 0.0
g                 0.0
i                 0.0
om                0.0
w                 0.0
q                 0.0
ad                0.0
per_y             0.0
data_arc          0.0
condition_code    0.0
n_obs_used        0.0
h                 0.0
diameter          0.0
extent            0.0
albedo            0.0
rot_per           0.0
gm                0.0
bv                0.0
ub                0.0
ir                0.0
spec_b            0.0
spec_t            0.0
neo               0.0
pha               0.0
moid              0.0
dtype: float64

In [20]:
rows,cols = remove_null_asteroid2.shape
print("Rows",rows)
print("cols",cols)

Rows 0
cols 27

In [21]:
# dealing with duplicate values

In [22]:
remove_duplicates_asteroid1 = remove_null_asteroid1.drop_duplicates()
remove_duplicates_asteroid1

Empty DataFrame
Columns: [full_name, a, e, g, i, om, w, q, ad, per_y, data_arc, condition_code, n_obs_used, h, diameter, extent, albedo, rot_per, gm, bv, ub, ir, spec_b, spec_t, neo, pha, moid]
Index: []

[0 rows x 27 columns]

In [23]:
remove_duplicates_asteroid2 = remove_null_asteroid2.drop_duplicates()
remove_duplicates_asteroid2

Empty DataFrame
Columns: [full_name, a, e, g, i, om, w, q, ad, per_y, data_arc, condition_code, n_obs_used, h, diameter, extent, albedo, rot_per, gm, bv, ub, ir, spec_b, spec_t, neo, pha, moid]
Index: []

[0 rows x 27 columns]

In [29]:
asteroid1.to_csv('asteroid1.csv', index=False)
asteroid1.to_csv('C:/Users/Samu_D/Data Engineering Coursework/newfld/asteroid1.csv', index=False)

In [30]:
asteroid2.to_csv('asteroid2.csv', index=False)
asteroid2.to_csv('C:/Users/Samu_D/Data Engineering Coursework/newfld/asteroid2.csv', index=False)

In [36]:
# Assuming enigma_jhud and rearc_covid_19_testing_data_states_dailystates_daily are already loaded as DataFrames

# Selecting the relevant columns from enigma_jhud
astero_1 = asteroid1[['full_name','a','e','i','q','ad','per_y','data_arc','n_obs_used','h','diameter','albedo','moid']]

# Selecting the relevant columns from rearc_covid_19_testing_data_states_dailystates_daily
astero_2 = asteroid2[['full_name','a','e','i','q','ad','per_y','data_arc','n_obs_used','h','albedo','moid']]

# Performing inner join on 'fips' column to merge the two DataFrames
asteroId = pd.merge(astero_1, astero_2, on='full_name', how='inner')

In [38]:
asteroId.to_csv('asteroId.csv', index=False)
asteroId.to_csv('C:/Users/Samu_D/Data Engineering Coursework/newfld/asteroId.csv', index=False)